//=============================================================================
//
//	デバッグ表示処理 [debugproc.cpp]
//	Author : SHUMA AIZU
// 
//=============================================================================

#include "main.h"
#include "debugproc.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_TEXT			(2048)			// 文字列の最大

//*****************************************************************************
// グローバル変数
//*****************************************************************************
LPD3DXFONT g_pFont = NULL;					// フォントへのポインタ
char g_aStrDebug[MAX_TEXT];					// 文字列(デバッグ情報)を格納するバッファ

//=============================================================================
//	デバッグ表示の初期化処理
//=============================================================================
void InitDebugProc(void)
{
	// デバイスの取得
	LPDIRECT3DDEVICE9 pDevice = GetDevice();

	// デバッグ表示用フォントの生成
	D3DXCreateFont(pDevice, 24, 0, 0, 0, FALSE, SHIFTJIS_CHARSET,
		OUT_DEFAULT_PRECIS, DEFAULT_QUALITY, DEFAULT_PITCH,
		"PixelMplus12", &g_pFont);

	// デバッグ情報バッファのクリア
	memset(&g_aStrDebug[0], 0, sizeof g_aStrDebug);
}

//=============================================================================
//	デバッグ表示の終了処理
//=============================================================================
void UninitDebugProc(void)
{
	// デバッグ表示用フォントの破棄
	if (g_pFont != NULL)
	{
		g_pFont->Release();
		g_pFont = NULL;
	}
}

//=============================================================================
//	デバッグ表示の更新処理
//=============================================================================
void UpdateDebugProc(void)
{
#ifndef _DEBUG
	// デバッグ情報バッファのクリア
	memset(&g_aStrDebug[0], 0, sizeof g_aStrDebug);
#endif // _DEBUG
}

//=============================================================================
//	デバッグ表示の描画処理
//=============================================================================
void DrawDebugProc(void)
{
	RECT rect = { 0, 0, SCREEN_WIDTH, SCREEN_HEIGHT };

	// テキストを描画
	g_pFont->DrawText(NULL, &g_aStrDebug[0], -1, &rect, DT_LEFT, D3DCOLOR_RGBA(255, 0, 0, 255));

	// デバッグ情報バッファのクリア
	memset(&g_aStrDebug[0], 0, sizeof g_aStrDebug);
}

//=============================================================================
//	デバッグ表示の情報登録処理
//=============================================================================
void PrintDebugProc(const char* fmt, ...)
{
	char aStr[256] = {};

	// 可変長引数リストの変数を定義する
	va_list args;

	// リストに受けとった文字列を代入
	va_start(args, fmt);

	// リストからバッファへ文字列を代入
	vsprintf(&aStr[0], fmt, args);

	// 終了
	va_end(args);

	// デバッグ表示バッファに受け取った文字列を連結
	strcat(&g_aStrDebug[0], &aStr[0]);
}