//==================================================================================================================================
//
//			エフェクトの処理 [effect.h]
//			Author : ENDO HIDETO
// 
//==================================================================================================================================
#ifndef _EFFECT_H_
#define _EFFECT_H_	// 2重インクルード防止

//==============================================================
// ヘッダーインクルード
#include "game.h"

//=========================================================================================
//マクロ定義
//=========================================================================================
#define MAX_EFFECT		(4096)		// エフェクトの最大数
#define colX			D3DXCOLOR	// 省略用
#define COLX_RED		colX(1.0f,0.0f,0.0f,1.0f)
#define COLX_GREEN		colX(0.0f,1.0f,0.0f,1.0f)
#define COLX_BLUE		colX(0.0f,0.0f,1.0f,1.0f)
#define COLX_NULl		colX(0,0,0,0)

//==============================================================
// エフェクト情報構造体
//==============================================================
typedef struct
{
	D3DXMATRIX mtxWorld;		// ワールドマトリックス
	D3DXVECTOR3 pos;			// 位置
	float fSize;				// 大きさ
	D3DXVECTOR3 move;			// 移動速度
	D3DXCOLOR col;				// 色
	float fSubLength;			// １F当たりサイズから引く値
	float fSubAlpha;			// １F当たりアルファ値から引く値
	int nLife;					// 寿命
	bool bUse;					// 使っているか
}Effect;

//=========================================================================================
//プロトタイプ宣言
//=========================================================================================
void InitEffect(void);
void UninitEffect(void);
void UpdateEffect(void);
void DrawEffect(void);
void SetEffect(D3DXVECTOR3 pos, D3DXVECTOR3 move,D3DXCOLOR col, int nLife,float fRadius);
int GetEffect(void);

#endif // !_EFFECT_H_
