//=============================================================================
//
//	ゲーム画面処理 [game.h]
//	Author : SHUMA AIZU
// 
//=============================================================================

#ifndef _GAME_H_
#define _GAME_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_WARD			(256)						// 文字列を読み込める最大

//*****************************************************************************
// ゲームの状態
//*****************************************************************************
typedef enum
{
	GAMEFLAG_NONE = 0,				// 何もしていない状態
	GAMEFLAG_NORMAL,				// 通常状態
	GAMEFLAG_CLEAR,					// クリア状態
	GAMEFLAG_GAMEOVER,				// ゲームオーバー状態
	GAMEFLAG_MAX
}GAMEFLAG;

//*****************************************************************************
// ゲームイベント
//*****************************************************************************
typedef enum
{
	GAMEEVENT_NONE = 0,				// 何もない
	GAMEEVENT_OP,					// オープニングイベント
	GAMEEVENT_MAX
}GAMEEVENT;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitGame(void);
void UninitGame(void);
void UpdateGame(void);
void DrawGame(void);

void SetGameFlag(GAMEFLAG state, int nCounter);
GAMEFLAG GetGameFlag(void);
GAMEFLAG GetNextGameFlag(void);

bool GetPause(void);
void SetEnablePause(bool bPause);

#endif