//=============================================================================
//
//	ポーズ処理 [pause.h]
//	Author : SHUMA AIZU
// 
//=============================================================================

#ifndef _PAUSE_H_
#define _PAUSE_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// ポーズメニュー
//*****************************************************************************
typedef enum
{
	PAUSE_MENU_CONTINUE = 0,		// ゲームに戻る
	PAUSE_MENU_RESTART,				// ゲームをやり直す
	PAUSE_MENU_QUIT,				// タイトル画面に戻る
	PAUSE_MENU_MAX					// 
}PAUSE_MENU;

//*****************************************************************************
// ポーズメニュー情報構造体
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;		// 位置
	D3DXVECTOR3 rot;		// 向き
	float fWidth;			// 幅
	float fHeight;			// 高さ
	float fLength;			// 長さ
	float fAngle;			// 角度
}PauseMenuInfo;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitPause(void);
void UninitPause(void);
void UpdatePause(void);
void DrawPause(void);
void SetPauseMenu(PAUSE_MENU pause_menu);
bool GetPauseDisp(void);

#endif