//==================================================================================================================================
//
//			ポリゴン [shadow.h]
//			Author : ENDO HIDETO
// 
//==================================================================================================================================
#ifndef _SHADOW_H_
#define _SHADOW_H_	//2重インクルード防止

//**************************************************************
// ヘッダーインクルード
#include "main.h"

//=========================================================================================
//マクロ定義
//=========================================================================================
#define MAX_SHADOW			(512)		// 影の最大数
#define SHADOW_SIZE			(15.0f)		//サイズ
#define SHADOW_SIZE_ADD		(1.0f)		//サイズ変更幅
#define REV_SHADOW			(0.01f)		//回転速度

//==============================================================
// 影情報構造体
//==============================================================
typedef struct
{
	D3DXVECTOR3 pos;
	D3DXVECTOR3 rot;
	D3DXVECTOR3 size;
	D3DXCOLOR	col;
	D3DXMATRIX	mtxWorld;
	bool		bUse;
}Shadow;

//=========================================================================================
//プロトタイプ宣言
//=========================================================================================
void InitShadow(void);
void UninitShadow(void);
void UpdateShadow(void);
void DrawShadow(void);

int SetShadow(float fSize);														//影の番号を取得
void SetPotisionShadow(int nIdxShadow, D3DXVECTOR3 pos,float fShadowHeight);	//影の位置をセット
void ReleaseShadow(int nIdxShadow);												//指定の影を開放

#endif // !_SHADOW_H_
