//=============================================================================
//
//	制限時間処理 [time.h]
//	Author : SHUMA AIZU
// 
//=============================================================================

#ifndef _TIME_H_
#define _TIME_H_

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitTime(void);
void UninitTime(void);
void UpdateTime(void);
void DrawTime(void);
int GetTime(void);

#endif
