//=============================================================================
//
//	タイトル画面処理 [title.cpp]
//	Author : SHUMA AIZU
// 
//=============================================================================

#include "main.h"
#include "title.h"
#include "debugproc.h"
#include "input.h"
#include "fade.h"
#include "loadscript.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// グローバル変数
//*****************************************************************************
TITLESTATE g_titleState = TITLESTATE_OP;							// タイトルの状態
int g_nCounterTitleState = 0;										// 状態管理カウンター

//====================================
//	タイトルの初期化処理
//====================================
void InitTitle(void)
{

}

//====================================
//	タイトルの終了処理
//====================================
void UninitTitle(void)
{

}

//====================================
//	タイトルの描画処理
//====================================
void DrawTitle(void)
{

}

//====================================
//	タイトルの更新処理
//====================================
void UpdateTitle(void)
{
	PrintDebugProc("TITLE\n");

	if (GetKeyboardTrigger(DIK_RETURN))
	{
		SetFade(MODE_GAME);
	}
}

//========================================
//	タイトルの状態設定
//========================================
void SetTitleState(TITLESTATE titlestate)
{
	g_titleState = titlestate;
}

//========================================
//	タイトルの状態取得
//========================================
TITLESTATE GetTitleState(void)
{
	return g_titleState;
}